[
  {
    "number": 1,
    "arab": "عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا ، أَو امْرأَةٍ يَنْكِحُهَا ، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إلَيْهِ",
    "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah bin Qa'nab al Qa'nabi] telah menceritakan kepada kami [Abdul Aziz yakni bin Muhammad] dari [Muhammad yakni bin Amru] dari [Abu Salamah] dari [Al Mughirah bin Syu'bah] bahwasanya Nabi shallallahu 'alaihi wasallam apabila hendak pergi untuk buang hajat, maka beliau menjauh."
  },
  {
    "number": 2,
    "arab": "عَنْ أَبِيْ عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بْنِ عُمَرَ بْن الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ: سَمِعْتُ النبي ﷺ يَقُوْلُ: بُنِيَ الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ، وَإِقَامِ الصَّلاةِ، وَإِيْتَاءِ الزَّكَاةِ، وَحَجِّ البِيْتِ، وَصَوْمِ رَمَضَانَ",
    "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Isa bin Yunus] telah mengabarkan kepada kami [Isma'il bin Abdul Malik] dari [Abu az Zubair] dari [Jabir bin Abdullah] bahwasanya Nabi shallallahu 'alaihi wasallam apabila hendak buang hajat, maka beliau pergi hingga tidak ada seorang pun yang melihatnya."
  },
  {
    "number": 3,
    "arab": "عَنْ عُمَرَ رَضِيَ اللهُ تَعَالَى عَنْهُ أقَال : بَيْنَمَا نَحْنُ جُلُوْسٌ عِنْدَ رَسُولِ اللهِ ذَاتَ يَوْمٍ إَذْ طَلَعَ عَلَيْناَ رَجُلٌ شَدِيْدُ بَيَاضِ الثّياب شَدِيْدُ سَوَادِ الشَّعْرِ لاَ يُرَى عَلَيهِ أَثَرُ السَّفَرِ وَلاَ يَعْرِفُهُ مِنا أحَدٌ حَتى جَلَسَ إلَى النبِي فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ وَوَضَعَ كَفيْهِ عَلَى فَخِذِيْهِ وَقَالَ : يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الإِسْلاَم ، فَقَالَ رَسُولُ اللهِ ﷺ : الإِسْلاَمُ أَنْ تَشْهَدَ أَنْ لاَ إلَه إلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُولُ الله ، وَتُقِيْمَ الصَّلاَة ، وَتُؤْتِيَ الزَّكَاةَ ، وَتَصُوْمَ رَمَضَانَ ، وَتَحُجَّ البيْتَ إِنِ اِسْتَطَعتَ إِليْهِ سَبِيْلاً  قَالَ: صَدَقْتَ. فَعجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ، قَالَ: فَأَخْبِرِنيْ عَنِ الإِيْمَانِ، قَالَ:  أَنْ تُؤمِنَ بِالله، وَمَلاِئكَتِه، وَكُتُبِهِ ، وَرُسُلِهِ ، وَالْيَومِ الآَخِر ، وَتُؤْمِنَ بِالقَدَرِ خَيْرِهِ وَشَرِّهِ  قَالَ: صَدَقْتَ، قَالَ فَأخْبِرْنِيْ عَنِ الإِحْسَانِ، قَالَ:  أَنْ تَعْبُدَ اللهَ كَأَنَكَ تَرَاهُ، فَإِنْ لمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ  . قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ ، قَالَ :  مَا الْمَسئُوُلُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ قَالَ : فَأخْبِرْنِيْ عَنْ أَمَارَاتِها ، قَالَ :  أَنْ تَلِدَ الأَمَةُ رَبَّتَهَا ، وَأَنْ تَرى الحُفَاةَ العُرَاةَ العَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُوْنَ فِي البُنْيَانِ  ثْمَّ انْطَلَقَ فَلَبِثتُ مَلِيَّاً ثُمَّ قَالَ :  يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟  قُلْتُ اللهُ وَرَسُوله أَعْلَمُ قَالَ : فَإِنَّهُ جِبْرِيْلُ أَتَاكُمْ يُعَلَّمُكُمْ دِيْنَكُمْ ",
    "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah mengabarkan kepada kami [Abu At Tayyah] dia berkata; Telah menceritakan kepada kami [Seorang Syaikh] dia berkata; Tatkala Abdullah bin Abbas datang ke Bashrah, ketika itu dia menceritakan hadits dari [Abu Musa], Abdullah menulis surat kepada Abu Musa dalam rangka menanyakan kepadanya tentang beberapa hal. Maka Abu Musa menulis surat kepadanya (sebagai jawaban), sesungguhnya saya pernah bersama Rasulullah shallallahu 'alaihi wasallam pada suatu hari, lalu beliau ingin buang air kecil, maka beliau mendatangi tempat yang bertanah lunak di bagian bawah dinding, kemudian beliau shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian hendak buang air kecil, maka hendaklah dia mencari tempat yang bertanah lunak untuk kencingnya.\""
  },
  {
    "number": 4,
    "arab": "عَنْ عَبْدِ اللهِ بنِ مَسْعُوْدْ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُوْلُ اللهِ ﷺ وَهُوَ الصَّادِقُ المَصْدُوْقُ :  إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِيْ بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْمَاً نُطْفَةً، ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ،ثُمَّ يَكُوْنُ مُضْغَةً مِثْلَ ذَلِكَ،ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ فَيَنفُخُ فِيْهِ الرٌّوْحَ،وَيَؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ. فَوَالله الَّذِي لاَ إِلَهَ غَيْرُهُ إِنََّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ حَتَّى مَا يَكُوْنُ بَيْنَهُ وَبَيْنَهَا إلاذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَايَكُونُ بَيْنَهُ وَبَيْنَهَا إلا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ فَيَدْخُلُهَا ",
    "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Hammad bin Zaid] dan [Abdul Warits] dari [Abdul Aziz bin Shuhaib] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam apabila hendak masuk WC -dia (Musaddad) meriwayatkan dari Hammad- beliau mengucapkan: \"Ya Allah, sesungguhnya aku berlindung kepadamu\" -sedangkan yang dia riwayatkan dari Abdul Harits- beliau mengucapkan: \"Aku berlindung kepada Allah dari setan jantan dan setan betina.\" Abu Dawud mengatakan; Syu'bah meriwayatkan dari Abdul Aziz (dengan lafazh); \"Ya Allah, sesungguhnya aku berlindung kepadaMu\", dalam kesempatan lain dia meriwayatkan (dengan lafazh); \"Aku berlindung kepada Allah\", dan Wuhaib menyebutkan; \"Hendaklah dia berlindung kepada Allah.\" Telah menceritakan kepada kami [Al Hasan bin Amru, yakni As Sadusi] telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Abdul Aziz, yaitu Ibnu Shuhaib] dari [Anas] dengan lafazh hadits ini, dia (Syu'bah) meriwayatkan (dari Abdul Aziz dengan lafazh); \"Ya Allah, sesungguhnya aku berlindung kepadaMu.\" Syu'bah mengatakan; Abdul Aziz dalam kesempatan lain meriwayatkan (dengan lafazh); \"Aku berlindung kepada Allah.\""
  },
  {
    "number": 5,
    "arab": "عَنْ أُمِّ المُؤمِنِينَ أُمِّ عَبْدِ اللهِ عَائِشَةَ - رَضِيَ اللهُ عَنْهَا - قَالَتْ: قَالَ رَسُوْلُ اللهِ :  مَنْ أَحْدَثَ فِيْ أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ",
    "id": "Telah menceritakan kepada kami [Amru bin Marzuq] telah mengabarkan kepada kami [Syu'bah] dari [Qatadah] dari [an Nadhr bin Anas] dari [Zaid bin Arqam] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya tempat buang hajat itu dihadiri oleh setan-setan, maka apabila salah seorang dari kalian mendatangi WC, hendaklah dia mengucapkan; 'Aku berlindung kepada Allah dari setan jantan dan setan betina'.\""
  },
  {
    "number": 6,
    "arab": "عَنْ أَبِيْ عَبْدِ اللهِ النُّعْمَانِ بْنِ بِشِيْر رضي الله عنهما قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: (إِنَّ الحَلالَ بَيِّنٌ وَإِنَّ الحَرَامَ بَيِّنٌ وَبَيْنَهُمَا أُمُوْرٌ مُشْتَبِهَات لاَ يَعْلَمُهُنَّ كَثِيْرٌ مِنَ النَّاس،ِ فَمَنِ اتَّقَى الشُّبُهَاتِ فَقَدِ اسْتَبْرأَ لِدِيْنِهِ وعِرْضِه، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الحَرَامِ كَالرَّاعِي يَرْعَى حَوْلَ الحِمَى يُوشِكُ أَنْ يَقَعَ فِيْهِ. أَلا وَإِنَّ لِكُلِّ مَلِكٍ حِمَىً . أَلا وَإِنَّ حِمَى اللهِ مَحَارِمُهُ، أَلا وإِنَّ فِي الجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الجَسَدُ كُلُّهُ وإذَا فَسَدَت فَسَدَ الجَسَدُ كُلُّهُ أَلا وَهيَ القَلْبُ)",
    "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [Ibrahim] dari [Abdurrahman bin Yazid] dari [Salman] dia berkata; dikatakan kepadanya; \"Sungguh Nabi kalian telah mengajarkan kepada kalian segala sesuatu hingga urusan buang hajat?\" Salman menjawab; \"Benar, beliau shallallahu 'alaihi wasallam telah melarang kami menghadap kiblat pada saat buang air besar atau buang air kecil, agar kami tidak beristinja dengan tangan kanan, agar salah seorang dari kami tidak beristinja dengan kurang dari tiga batu, atau beristinja dengan kotoran binatang atau tulang.\""
  },
  {
    "number": 7,
    "arab": "عَنْ أَبِيْ رُقَيَّةَ تَمِيْم بْنِ أَوْسٍ الدَّارِيِّ رضي الله عنه أَنَّ النبي ﷺ قَالَ:( الدِّيْنُ النَّصِيْحَةُ قُلْنَا: لِمَنْ يَا رَسُولَ اللهِ ؟ قَالَ: للهِ، ولكتابه، ولِرَسُوْلِهِ، وَلأَئِمَّةِ المُسْلِمِيْنَ، وَعَامَّتِهِمْ",
    "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad an Nufaili] telah menceritakan kepada kami [Ibnul Mubarak] dari [Muhammad bin Ajlan] dari [al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku bagi kalian hanyalah seperti kedudukan orang tua, aku ajarkan kepada kalian; apabila salah seorang dari kalian hendak buang air, janganlah dia menghadap kiblat, jangan pula membelakanginya, dan jangan beristinja dengan tangan kanannya.\" Dan beliau juga menyuruh untuk beristinja dengan tiga batu, serta melarang beristinja dengan kotoran binatang dan tulang basah. "
  },
  {
    "number": 8,
    "arab": "عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُوْلَ اللهِ قَالَ: (أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ وَيُقِيْمُوْا الصَّلاةَ وَيُؤْتُوا الزَّكَاةَ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءهَمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّ الإِسْلامِ وَحِسَابُهُمْ عَلَى اللهِ تَعَالَى)",
    "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Sufyan] dari [az Zuhri] dari ['Atha` bin Yazid al Laitsi] dari [Abu Ayyub] yang dia riwayatkan dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \"Apabila kalian mendatangi tempat buang hajat, maka janganlah kalian menghadap kiblat pada saat buang air besar dan buang air kecil, akan tetapi menghadaplah ke timur atau ke barat.\" Lalu kami datang ke Syam, ternyata kami dapati tempat-tempat buang hajat telah dibangun menghadap kiblat, maka kami berpaling darinya dan memohon ampun kepada Allah. "
  },
  {
    "number": 9,
    "arab": "عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ الله تَعَالَى عَنْهُ قَالَ: سَمِعْتُ رَسُوْلَ اللهِ ﷺ يَقُوْلُ: (مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ وَمَا أَمَرْتُكُمْ بِهِ فأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ؛ فَإِنَّمَا أَهْلَكَ الَّذِيْنَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلافُهُمْ عَلَى أَنْبِيَائِهِمْ)",
    "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Wuhaib] telah menceritakan kepada kami ['Amru bin Yahya] dari [Abu Zaid] dari [Abu Ma'qil Al Asadi] dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang kita menghadap dua kiblat (Makkah dan Baitul Maqdis) pada saat buang air besar atau buang air kecil. Abu Dawud mengatakan; Abu Zaid adalah mantan sahaya Bani Tsa'labah. "
  },
  {
    "number": 10,
    "arab": "عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ تَعَالَى عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ : (إِنَّ اللهَ تَعَالَى طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبَاً وَإِنَّ اللهَ أَمَرَ المُؤْمِنِيْنَ بِمَا أَمَرَ بِهِ المُرْسَلِيْنَ فَقَالَ : (يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحاً) (المؤمنون: الآية51) ، وَقَالَ: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ ) (البقرة: الآية172) ثُمَّ ذَكَرَ الرَّجُلَ يُطِيْلُ السَّفَرَ أَشْعَثَ أَغْبَرَ، يَمُدُّ يَدَيْهِ إِلَى السَّمَاء،ِ يَا رَبِّ يَا رَبِّ، وَمَطْعَمُهُ حَرَامٌ ،وَمَشْرَبُهُ حَرَامٌ، وَغُذِيَ بِالحَرَامِ فَأَنَّى يُسْتَجَابُ لذلك)",
    "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Shafwan bin Isa] dari [Al Hasan bin Dzakwan] dari [Marwan Al Ashfar] dia berkata; Saya pernah melihat [Ibnu Umar] menderumkan untanya menghadap kiblat, lalu dia duduk dan buang air kecil dalam keadaan menghadapnya, lalu saya bertanya; \"wahai Abu Abdurrahman, bukankah hal ini telah dilarang?\" Dia menjawab; \"Benar, akan tetapi hal itu dilarang jika dilakukan di tempat terbuka, apabila antara dirimu dan kiblat ada sesuatu yang menutupimu, maka itu tidaklah mengapa.\""
  },
  {
    "number": 11,
    "arab": "عَنْ أَبِي مُحَمَّدٍ الحَسَنِ بنِ عَلِيّ بنِ أبِي طالبٍ سِبْطِ رَسُولِ اللهِ ﷺ وَرَيْحَانَتِهِ رَضِيَ اللهُ عَنْهُمَا قَالَ: حَفِظْتَ مِنْ رَسُوْلِ اللهِ ﷺ : (دَعْ مَا يَرِيْبُكَ إِلَى مَا لاَ يَرِيْبُكَ)",
    "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Yahya bin Sa'id] dari [Muhammad bin Yahya bin Habban] dari [pamannya, Wasi' bin Habban] dari [Abdullah bin Umar] dia berkata; \"Sungguh, saya pernah naik atap rumah, lalu saya melihat Rasulullah shallallahu 'alaihi wasallam di atas dua batu bata menghadap Baitul Maqdis dalam keadaan buang hajatnya.\""
  },
  {
    "number": 12,
    "arab": "عَنْ أَبِيْ هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ : (مِنْ حُسْنِ إِسْلامِ المَرْءِ تَرْكُهُ مَا لاَ يَعْنِيْهِ)",
    "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [ayahku] dia berkata; Saya pernah mendengar [Muhammad bin Ishaq] menceritakan hadits dari [Aban bin Shalih] dari [Mujahid] dari [Jabir bin Abdullah] dia berkata; Nabiyullah shallallahu 'alaihi wasallam telah melarang kita menghadap kiblat tatkala buang air kecil, kemudian saya melihat beliau setahun sebelum wafat, buang air kecil menghadap kiblat. "
  },
  {
    "number": 13,
    "arab": "عَنْ أَبِيْ حَمْزَة أَنَسِ بنِ مَالِكٍ رَضِيَ اللهُ تَعَالَى عَنْهُ خَادِمِ رَسُوْلِ اللهِ ﷺ عَن النبي ﷺ قَالَ: (لاَ يُؤمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لأَخِيْهِ مَا يُحِبُّ لِنَفْسِهِ)",
    "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [seorang laki-laki] dari [Ibnu Umar] bahwasanya Nabi shallallahu 'alaihi wasallam apabila hendak buang hajat, beliau tidak mengangkat pakaiannya hingga telah dekat dari tanah. Abu Dawud berkata; Diriwayatkan oleh [Abdussalam bin Harb] dari [Al A'masy] dari [Anas bin Malik], namun dia (Al A'masy) dha'if. Abu Isa Ar Ramli berkata; Telah menceritakan kepada kami Ahmad bin Al Walid telah menceritakan kepada kami Amru bin 'Aun telah mengabarkan kepada kami Abdussalam dengan hadits ini. "
  },
  {
    "number": 14,
    "arab": "َعنِ ابْنِ مَسْعُودٍ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ : (لا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ إِلاَّ بإِحْدَى ثَلاثٍ: الثَّيِّبُ الزَّانِيْ، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّاركُ لِدِيْنِهِ المُفَارِقُ للجمَاعَةِ)",
    "id": "Telah menceritakan kepada kami [Ubaidullah bin Umar bin Maisarah] telah menceritakan kepada kami [Ibnu Mahdi] telah menceritakan kepada kami [Ikrimah bin Ammar] dari [Yahya bin Abu Katsir] dari [Hilal bin 'Iyadh] dia berkata; Telah menceritakan kepada saya [Abu Sa'id] dia berkata; Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah dua orang laki-laki pergi ke tempat buang hajat dalam keadaan membuka aurat keduanya, lalu bercakap-cakap, karena sesungguhnya Allah 'azza wajalla membenci demikian.\" Abu Dawud berkata; kalimat ini tidak diisnadkan kecuali oleh Ikrimah bin Ammar. "
  },
  {
    "number": 15,
    "arab": "عَن أَبِي هُرَيْرَةَ رضي الله عنه أَنَّ رَسُولَ اللهِ ﷺ قَالَ: (مَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَوْمِ الآخِرِ فَلْيَقُلْ خَيْرَاً أَو لِيَصْمُتْ، وَمَنْ كَانَ يُؤمِنُ بِاللهِ وَاليَومِ الآخِرِ فَلْيُكْرِمْ جَارَهُ، ومَنْ كَانَ يُؤمِنُ بِاللهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ)",
    "id": "Telah menceritakan kepada kami [Utsman] dan [Abu Bakar] keduanya putra Abu Syaibah, mereka berkata; Telah menceritakan kepada kami [Umar bin Sa'd] dari [Sufyan] dari [Adh Dhahhak bin Utsman] dari [Nafi'] dari [Ibnu Umar] dia berkata; Pernah ada seorang laki-laki melewati Nabi shallallahu 'alaihi wasallam ketika beliau sedang buang air kecil, lalu laki-laki itu mengucapkan salam kepada beliau, namun beliau tidak menjawab salamnya. Abu Dawud mengatakan; Telah diriwayatkan dari Ibnu Umar dan selainnya, bahwasanya Nabi shallallahu 'alaihi wasallam bertayammum, kemudian beliau menjawab salam laki-laki tersebut. "
  },
  {
    "number": 16,
    "arab": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلاً قَالَ لِلنَّبيِّ ﷺ : أَوصِنِيْ، قَال : (لاَ تَغْضَبْ) ",
    "id": "Telah menceritakan kepada kami [Muhammad bin al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Hudhain bin Al Mundzir Abi Sasan] dari [Al Muhajir bin Qunfudz] Bahwasanya dia pernah menemui Nabi shallallahu 'alaihi wasallam ketika beliau sedang buang air kecil, lalu dia mengucapkan salam kepada Nabi, namun beliau tidak menjawab salamnya hingga berwudhu, kemudian beliau meminta maaf seraya bersabda: \"Sesungguhnya aku tidak suka menyebut Nama Allah Ta'ala kecuali dalam keadaan suci.\""
  },
  {
    "number": 17,
    "arab": "عَنْ أَبِي يَعْلَى شَدَّادِ بنِ أَوْسٍ رَضِيَ اللهُ تَعَالَى عَنْهُ عَنْ رَسُولِ اللهِ ﷺ قَالَ: (إِنَّ اللهَ كَتَبَ الإِحْسَانَ عَلَى كُلِّ شَيءٍ. فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا القِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيْحَتَهُ)",
    "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah menceritakan kepada kami [Ibnu Abi Za`idah] dari [Ayahnya] dari [Khalid bin Salamah, yakni Al Fa`fa] dari [Al Bahiy] dari ['Urwah] dari [Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam selalu berdzikir kepada Allah 'azza wajalla di setiap kondisi beliau. "
  },
  {
    "number": 18,
    "arab": "عَنْ أَبِيْ ذَرٍّ جُنْدُبِ بنِ جُنَادَةَ وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بِنِ جَبَلٍ رَضِيَ اللهُ عَنْهُمَا عَنْ رَسُولِ اللهِ ﷺ قَالَ: (اتَّقِ اللهَ حَيْثُمَا كُنْتَ، وَأَتْبِعِ السَّيِّئَةَ الحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ ) ",
    "id": "Telah menceritakan kepada kami [Nashr bin Ali] dari [Abu Ali Al Hanafi] dari [Hammam] dari [Ibnu Juraij] dari [Az Zuhri] dari [Anas] dia berkata; Nabi shallallahu 'alaihi wasallam apabila hendak masuk WC, beliau menanggalkan cincinnya. Abu Dawud berkata; Ini adalah hadits munkar, sedang yang diketahui dari [Ibnu Juraij] dari [Ziyad bin Sa'ad] dari [Az Zuhri] dari [Anas] adalah bahwasanya Nabi shallallahu 'alaihi wasallam menggunakan cincin dari perak kemudian beliau membuangnya. Kekeliruan di sini dari Hammam, dan hadits ini tidak diriwayatkan kecuali dari Hammam. "
  },
  {
    "number": 19,
    "arab":"عَنْ أَبِيْ ذَرٍّ جُنْدُبِ بنِ جُنَادَةَ وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بِنِ جَبَلٍ رَضِيَ اللهُ عَنْهُمَا عَنْ رَسُولِ اللهِ ﷺ قَالَ: (اتَّقِ اللهَ حَيْثُمَا كُنْتَ، وَأَتْبِعِ السَّيِّئَةَ الحَسَنَةَ تَمْحُهَا، وَخَالِقِ النَّاسَ بِخُلُقٍ حَسَنٍ ) ",
    "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Hannad bin As Sari] mereka berdua berkata; Telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Al A'masy] dia berkata; Saya mendengar [Mujahid] menceritakan dari [Thawus] dari [Ibnu Abbas] dia berkata; Nabi shallallahu 'alaihi wasallam pernah melewati dua kuburan lalu bersabda: \"Sesungguhnya keduanya sedang diadzab, dan keduanya tidak diadzab karena dosa besar. Adapun yang ini, maka karena dia tidak bersuci dari kencing, sedangkan yang ini, karena dia berjalan dengan namimah.\" Kemudian beliau menyuruh seseorang mengambil dahan kurma basah, lalu dibelah menjadi dua, kemudian beliau menanamkannya pada kuburan ini dan menanamkan satunya pada kuburan yang lain, dan beliau bersabda: \"Semoga ia dapat meringankan keduanya selama ia belum kering.\" Hannad meriwayatkan dengan lafazh yastatir pada tempat yastanzih. Telah menceritakan kepada kami [Utsman bin Abu Syaibah] telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Mujahid] dari [Ibnu Abbas] dari Nabi shallallahu 'alaihi wasallam, yang semakna dengan lafazh di atas, dia menyebutkan; \"dia tidak menutup diri dari kencingnya\", sedangkan Mu'awiyah menyebutkan; \"dia tidak bersuci.\""
  },
  {
    "number": 20,
    "arab": "عَنْ أَبيْ مَسْعُوْدٍ عُقبَة بنِ عَمْرٍو الأَنْصَارِيِّ البَدْرِيِّ رضي الله عنه قَالَ: قَالَ رَسُوْلُ اللهِ ﷺ (إِنَّ مِمَّا أَدرَكَ النَاسُ مِن كَلاَمِ النُّبُوَّةِ الأُولَى إِذا لَم تَستَحْيِ فاصْنَعْ مَا شِئتَ) ",
    "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abdulwahid bin Ziyad] telah menceritakan kepada kami [Al A'masy] dari [Zaid bin Wahb] dari [Abdurrahman bin Hasanah] dia berkata; Saya pernah pergi bersama Amru bin Al Ash menemui Rasulullah shallallahu 'alaihi wasallam, kemudian beliau keluar dengan membawa perisai, lalu menutup diri dengannya dan buang air kecil. Maka kami katakan; \"Lihatlah, beliau buang air kecil seperti perempuan buang air kecil.\" Nabi mendengar hal itu, maka beliau bersabda: \"Apakah kalian belum tahu apa yang didapatkan oleh salah seorang Bani Israil? Dahulu bani israil apabila terkena air kencing, maka mereka memotong bagian yang terkena air kencing, lalu orang tersebut melarang mereka dari perbuatan demikian, maka dia pun diadzab di dalam kuburnya.\" Abu Dawud berkata; [Manshur] berkata dari [Abu Wa`il] dari [Abu Musa] berkenaan dengan hadits ini, dia meyebutkan; (Yakni apabila mengenai) kulit salah seorang dari mereka. Sedangkan ['Ashim] berkata dari [Abu Wa`il] dari [Abu Musa] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tubuh salah seorang dari mereka.\""
  },
  {
    "number": 21,
    "arab": "عَنِ أَبيْ عَمْرٍو، وَقِيْلَ،أَبيْ عمْرَةَ سُفْيَانَ بنِ عَبْدِ اللهِ رضي الله عنه قَالَ: قُلْتُ يَا رَسُوْلَ اللهِ قُلْ لِيْ فِي الإِسْلامِ قَوْلاً لاَ أَسْأَلُ عَنْهُ أَحَدَاً غَيْرَكَ؟ قَالَ: (قُلْ آمَنْتُ باللهِ ثُمَّ استَقِمْ)",
    "id": "Telah menceritakan kepada kami [Hafsh bin Umar] dan [Muslim bin Ibrahim] mereka berdua berkata; Telah menceritakan kepada kami [Syu'bah]. Dan menurut jalur yang lain; Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu 'Awanah] dan ini adalah lafazh Hafsh dari [Sulaiman] dari [Abu Wa`il] dari [Hudzaifah] dia berkata; \"Rasulullah shallallahu 'alaihi wasallam pernah mendatangi tempat pembuangan sampah suatu kaum, lalu buang air kecil dengan berdiri, kemudian beliau meminta untuk didatangkan air, lalu beliau mengusap dua khufnya.\" Abu Dawud berkata; Musaddad berkata; Hudzaifah berkata; Lalu saya pergi menjauh dari beliau, namun beliau memanggil saya hingga saya berada di sisi tumitnya. "
  },
  {
    "number": 22,
    "arab": "عَنْ أَبيْ عَبْدِ اللهِ جَابِرِ بنِ عَبْدِ اللهِ الأَنْصَارِيِّ رضي الله عنه أَنَّ رَجُلاً سَأَلَ النبي ﷺ فَقَالَ: (أَرَأَيتَ إِذا صَلَّيْتُ المَكْتُوبَاتِ، وَصُمْتُ رَمَضانَ، وَأَحلَلتُ الحَلاَلَ، وَحَرَّمْتُ الحَرَامَ، وَلَمْ أَزِدْ عَلى ذَلِكَ شَيئاً أَدخُلالجَنَّة ؟ قَالَ: نَعَمْ)",
    "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dari [Hukaimah binti Umaimah binti Ruqaiqah] dari [Ibunya] bahwasanya dia berkata; Nabi shallallahu 'alaihi wasallam memiliki bejana dari pelepah kurma (yang beliau letakkan) di bawah ranjangnya, yang beliau gunakan untuk buang air kecil pada waktu malam hari. "
  },
  {
    "number": 23,
    "arab": "عَنْ أَبِي مَالِكٍ الحَارِثِ بنِ عَاصِم الأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللهِ ﷺ : )الطُّهُورُ شَطْرُ الإِيْمَانِ، والحَمْدُ للهِ تَمْلأُ الميزانَ، وسُبْحَانَ اللهِ والحَمْدُ للهِ تَمْلآنِ - أَو تَمْلأُ - مَا بَيْنَ السَّمَاءِ والأَرْضِ، وَالصَّلاةُ نُورٌ، والصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالقُرْآنُ حُجَّةٌ لَكَ أَو عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَو مُوبِقُهَا",
    "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Al 'Ala` bin Abdurrahman] dari [Ayahnya] dari [Abu Hurairah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Takutlah kalian terhadap perihal dua orang yang terlaknat.\" Mereka (para sahabat) bertanya; \"Siapakah dua orang yang terlaknat itu wahai Rasulullah?\" Beliau menjawab: \"Yaitu orang yang buang air besar di jalanan manusia atau tempat berteduhnya mereka.\""
  },
  {
    "number": 24,
    "arab": "عَنْ أَبي ذرٍّ الغِفَارْي رضي الله عنه عَن النبي ﷺ فيمَا يَرْويه عَنْ رَبِِّهِ عزَّ وجل أَنَّهُ قَالَ: (يَا عِبَادِيْ إِنِّيْ حَرَّمْتُ الظُّلْمَ عَلَى نَفْسِيْ وَجَعَلْتُهُ بَيْنَكُمْ مُحَرَّمَاً فَلا تَظَالَمُوْا، يَا عِبَادِيْ كُلُّكُمْ ضَالٌّ إِلاَّ مَنْ هَدَيْتُهُ فَاسْتَهْدُوْنِي أَهْدِكُمْ، يَا عِبَادِيْ كُلُّكُمْ جَائِعٌ إِلاَّ مَنْ أَطْعَمْتُهُ فاَسْتَطْعِمُونِي أُطْعِمْكُمْ، يَا عِبَادِيْ كُلُّكُمْ عَارٍ إِلاَّ مَنْ كَسَوْتُهُ فَاسْتَكْسُوْنِيْ أَكْسُكُمْ، يَا عِبَادِيْ إِنَّكُمْ تُخْطِئُوْنَ بِاللَّيْلِ وَالنَّهَارِ وَأَنَا أَغْفِرُ الذُّنُوْبَ جَمِيْعَاً فَاسْتَغْفِرُوْنِيْ أَغْفِرْ لَكُمْ، يَا عِبَادِيْ إِنَّكُمْ لَنْ تَبْلُغُوْا ضَرِّيْ فَتَضُرُّوْنِيْ وَلَنْ تَبْلُغُوْا نَفْعِيْ فَتَنْفَعُوْنِيْ، يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا زَادَ ذَلِكَ فَيْ مُلْكِيْ شَيْئَاً. يَا عِبَادِيْ لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوْا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِيْ شَيْئَاً، يَا عِبَادِيْ لَوْ أنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإنْسَكُمْ وَجِنَّكُمْ قَامُوْا فِيْ صَعِيْدٍ وَاحِدٍ فَسَأَلُوْنِيْ فَأَعْطَيْتُ كُلَّ وَاحِدٍ مَسْأَلَتَهُ مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِيْ إِلاَّ كَمَا يَنْقُصُ المِخْيَطُ إَذَا أُدْخِلَ البَحْرَ، يَا عِبَادِيْ إِنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيْهَا لَكُمْ ثُمَّ أُوَفِّيْكُمْ إِيَّاهَا فَمَنْ وَجَدَ خَيْرَاً فَليَحْمَدِ اللهَ وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلاَ يَلُوْمَنَّ إِلاَّ نَفْسَهُ)",
    "id": "Telah menceritakan kepada kami [Ishaq bin Suwaid Ar Ramli] dan [Umar bin Al Khaththab Abu Hafsh] dan haditsnya lebih sempurna, bahwasanya [Sa'id bin Al Hakam] telah menceritakan kepada mereka, dia berkata; Telah mengabarkan kepada kami [Nafi' bin Yazid] telah menceritakan kepada kami [Haiwah bin Syuraih] bahwasanya [Abu Sa'id Al Himyari] telah menceritakan kepadanya dari [Mu'adz bin Jabal], dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Takutlah kalian terhadap tiga hal yang terlaknat; buang air besar di sumber air, tengah jalanan, dan tempat berteduh.\""
  },
  {
    "number": 25,
    "arab": "عَنْ أَبي ذَرٍّ رضي الله عنه قال: أَنَّ أُنَاسَاً مِنْ أَصحَابِ رَسُولِ اللهِ ﷺ قَالوا للنَّبي ﷺ يَارَسُولَ الله: ذَهَبَ أَهلُ الدثورِ بِالأُجورِ، يُصَلُّوْنَ كَمَا نُصَلِّيْ، وَيَصُوْمُوْنَ كَمَا نَصُوْمُ، وَيَتَصَدَّقُوْنَ بفُضُوْلِ أَمْوَالِهِمْ، قَالَ: (أَوَ لَيْسَ قَدْ جَعَلَ اللهُ لَكُمْ مَا تَصَّدَّقُوْنَ؟ إِنَّ بِكُلِّ تَسْبِيْحَةٍ صَدَقَة.وَكُلِّ تَكْبِيْرَةٍ صَدَقَةً وَكُلِّ تَحْمَيْدَةٍ صَدَقَةً وَكُلِّ تَهْلِيْلَةٍ صَدَقَةٌ وَأَمْرٌ بالِمَعْرُوْفٍ صَدَقَةٌ وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِيْ بُضْعِ أَحَدِكُمْ صَدَقَةٌ قَالُوا: يَا رَسُوْلَ اللهِ أَيَأْتِيْ أَحَدُنَا شَهْوَتَهُ وَيَكُوْنُ لَهُ فِيْهَا أَجْرٌ؟ قَالَ:أَرَأَيْتُمْ لَوْ وَضَعَهَا فَيْ حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إِذَا وَضَعَهَا فَي الحَلالِ كَانَ لَهُ أَجْرٌ)",
    "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] dan [Al Hasan bin Ali] mereka berdua berkata; Telah menceritakan kepada kami [Abdurrazzaq]. [Ahmad] berkata; telah menceritakan kepada kami [Ma'mar] telah mengabarkan kepada saya [Asy'ats] dan [Al Hasan] berkata dari [Asy'ats bin Abdullah] dari [Al Hasan] dari [Abdullah bin Mughaffal] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah sekali-kali salah seorang di antara kalian kencing di tempat mandinya kemudian dia mandi di tempat tersebut.\" Sedang Ahmad menyebutkan; Kemudian dia berwudhu di tempat tersebut, karena kebanyakan was was adalah dari padanya. "
  },
  {
    "number": 26,
    "arab": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (كُلُّ سُلامَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلُّ يَومٍ تَطْلُعُ فِيْهِ الشَّمْسُ: تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِيْنُ الرَّجُلَ في دَابَّتِهِ فَتَحْمِلُ لَهُ عَلَيْهَا أَو تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ تَمْشِيْهَا إِلَى الصَّلاةِ صَدَقَةٌ، وَتُمِيْطُ الأَذى عَنِ الطَّرِيْقِ صَدَقَةٌ)",
    "id": "Telah menceritakan kepada kami [Ahmad bin Yunus] telah menceritakan kepada kami [Zuhair] dari [Dawud bin Abdullah] dari [Humaid Al Himyari] dan dia adalah Ibnu Abdurrahman, dia berkata; Saya pernah bertemu dengan [seorang laki-laki yang pernah bersahabat] dengan Nabi shallallahu 'alaihi wasallam sebagaimana Abu Hurairah bersahabat dengan beliau, dia berkata; Rasulullah shallallahu 'alaihi wasallam melarang salah seorang dari kami menyisir rambut setiap hari atau buang air kecil di tempat mandinya. "
  },
  {
    "number": 27,
    "arab": "عن النواس بن سمعان رضي الله عنهما ، عن النبي ﷺ قال: (البر حسن الخلق ، والإثم ما حاك في نفسك وكرهت أن يطلع عليه الناس ) .رواه مسلم.وعن وابصة بن معبد رضى الله عنه ، قال : أتيت رسول الله ﷺ ، فقال : (جئت تسأل عن البر و الإثم ؟) قلت : نعم ؛ قال : (استفت قلبك ؛ البر ما اطمأنت إليه النفس واطمأن اليه القلب ، والإثم ما حاك في النفس وتردد في الصدر ، وإن أفتاك الناس وأفتوك)",
    "id": "Telah menceritakan kepada kami [Ubaidullah bin Umar bin Maisarah] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah menceritakan kepada saya [Ayahku] dari [Qatadah] dari [Abdullah bin Sarjis] bahwasanya Rasulullah shallallahu 'alaihi wasallam melarang kencing di lubang. Mereka bertanya kepada Qatadah; \"Apa yang membuat kencing di lubang dilarang?\" Dia menjawab; \"Dikatakan bahwa ia adalah tempat tinggal jin.\""
  },
  {
    "number": 28,
    "arab": "عَن أَبي نَجِيحٍ العربَاضِ بنِ سَاريَةَ رضي الله عنه قَالَ: وَعَظَنا رَسُولُ اللهِ مَوعِظَةً وَجِلَت مِنهَا القُلُوبُ وَذَرَفَت مِنهَا العُيون. فَقُلْنَا: يَارَسُولَ اللهِ كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوصِنَا، قَالَ: (أُوْصِيْكُمْ بِتَقْوَى اللهِ عز وجل وَالسَّمعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلافَاً كَثِيرَاً؛ فَعَلَيكُمْ بِسُنَّتِيْ وَسُنَّةِ الخُلَفَاءِ الرَّاشِدِينَ المّهْدِيِّينَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَإِيَّاكُمْ وَمُحْدَثَاتِ الأُمُورِ فإنَّ كلّ مُحدثةٍ بدعة، وكُلَّ بِدْعَةٍ ضَلالَةٌ)",
    "id": "Telah menceritakan kepada kami [Amru bin Muhammad An Naqid] telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Isra`il] dari [Yusuf bin Abu Burdah] dari [Ayahnya] telah menceritakan kepada saya [Aisyah] radliallahu 'anha bahwasanya Rasulullah shallallahu 'alaihi wasallam apabila keluar dari WC, beliau mengucapkan: \"GHUFRAANAKA (Aku mohon ampunanMu).\""
  },
  {
    "number": 29,
    "arab": "عَن مُعَاذ بن جَبَلٍ رضي الله عنه قَالَ: قُلتُ يَا رَسُولَ الله أَخبِرنِي بِعَمَلٍٍ يُدخِلُني الجَنَّةَ وَيُبَاعدني منٍ النار قَالَ: (لَقَدْ سَأَلْتَ عَنْ عَظِيْمٍ وَإِنَّهُ لَيَسِيْرٌ عَلَى مَنْ يَسَّرَهُ اللهُ تَعَالَى عَلَيْهِ: تَعْبُدُ اللهَ لاَتُشْرِكُ بِهِ شَيْئَا، وَتُقِيْمُ الصَّلاة، وَتُؤتِي الزَّكَاة، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ البَيْتَ. ثُمَّ قَالَ: أَلاَ أَدُلُّكَ عَلَى أَبْوَابِ الخَيْرِ: الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الخَطِيْئَةَ كَمَا يُطْفِئُ المَاءُ النَّارَ، وَصَلاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ ثُمَّ تَلا : (تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ) حَتَّى بَلَغَ: (يَعْلَمُونْ) [السجدة:16-17] ثُمَّ قَالَ: أَلا أُخْبِرُكَ بِرَأْسِ الأَمْرِ وَعَمُودِهِ وَذِرْوَةِ سَنَامِهِ ؟ قُلْتُ: بَلَى يَارَسُولَ اللهِ، قَالَ: رَأْسُ الأَمْرِ الإِسْلامُ وَعَمُودُهُ الصَّلاةُ وَذروَةُ سَنَامِهِ الجِهَادُ ثُمَّ قَالَ: أَلا أُخبِرُكَ بِملاكِ ذَلِكَ كُلِّهِ ؟ قُلْتُ:بَلَى يَارَسُولَ اللهِ. فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْكَ هَذَا. قُلْتُ يَانَبِيَّ اللهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ ؟ فَقَالَ: ثَكِلَتْكَ أُمُّكَ يَامُعَاذُ. وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ أَو قَالَ: عَلَى مَنَاخِرِهِمْ إِلاَّ حَصَائِدُ أَلسِنَتِهِمْ)",
    "id": "Telah menceritakan kepada kami [Muslim bin Ibrahim] dan [Musa bin Isma'il] mereka berdua berkata; Telah menceritakan kepada kami [Aban] telah menceritakan kepada kami [Yahya] dari [Abdullah bin Abu Qatadah] dari [Ayahnya] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian buang air kecil, maka janganlah dia menyentuh kemaluannya dengan tangan kanannya. Apabila dia mendatangi WC (untuk buang air), maka janganlah dia beristinja dengan tangan kanannya. Dan apabila dia minum, maka janganlah dia minum dengan satu kali nafas.\""
  },
  {
    "number": 30,
    "arab": "عَنْ أَبِيْ ثَعْلَبَةَ الخُشَنِيِّ جُرثُومِ بنِ نَاشِرٍ رضي الله عنه عَن رَسُولِ اللهِ ﷺ قَالَ: (إِنَّ اللهَ فَرَضَ فَرَائِضَ فَلا تُضَيِّعُوهَا، وَحَدَّ حُدُودَاً فَلا تَعْتَدُوهَا وَحَرَّمَ أَشْيَاءَ فَلا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلا تَبْحَثُوا عَنْهَا)",
    "id": "Telah menceritakan kepada kami [Muhammad bin Adam bin Sulaiman Al Mishshishi] telah menceritakan kepada kami [Ibnu Abi Za`idah] dia berkata; Telah menceritakan kepada saya [Abu Ayyub, yakni Al Ifriqi] dari ['Ashim] dari [Al Musayyab bin Rafi'] dan [Ma'bad] dari [Haritsah bin Wahb Al Khuza'i] dia berkata; Telah menceritakan kepada saya [Hafshah], [istri Nabi] shallallahu 'alaihi wasallam, bahwasanya Nabi shallallahu 'alaihi wasallam menjadikan tangan kanannya untuk makan, minum, dan berpakaian, dan menjadikan tangan kirinya untuk selain dari itu. "
  },
  {
    "number": 31,
    "arab": "عَنْ أَبي العَباس سَعدِ بنِ سَهلٍ السَّاعِدي رضي الله عنه قَالَ: جَاءَ رَجُلٌ إِلَى النبي ﷺ فَقَالَ: يَا رَسُول الله: دُلَّني عَلَى عَمَلٍ إِذَا عَمَلتُهُ أَحَبَّني اللهُ، وَأَحبَّني النَاسُ ؟ فَقَالَ: (ازهَد في الدُّنيَا يُحِبَّكَ اللهُ ، وازهَد فيمَا عِندَ النَّاسِ يُحِبَّكَ النَّاسُ) ",
    "id": "Telah menceritakan kepada kami [Abu Taubah Ar Rabi' bin Nafi'] telah menceritakan kepada saya [Isa bin Yunus] dari [Ibnu Abi 'Arubah] dari [Abu Ma'syar] dari [Ibrahim] dari [Aisyah] dia berkata; \"Tangan kanan Rasulullah shallallahu 'alaihi wasallam adalah untuk bersuci dan makannya, sedangkan tangan kirinya adalah untuk beristinja dan membersihkan kotoran.\" Telah menceritakan kepada kami [Muhammad bin Hatim bin Buzai'] telah menceritakan kepada kami [Abdulwahhab bin 'Atha`] dari [Sa'id] dari [Abu Ma'syar] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] dari Nabi shallallahu 'alaihi wasallam, dengan lafazh yang semakna. "
  },
  {
    "number": 32,
    "arab": "عن أبي سعيد سعد بن مالك بن سنان الخدري رضي الله عنه أن رسول الله ( ﷺ ) قال: (لا ضرر ولا ضرار)",
    "id": "Telah menceritakan kepada kami [Ibrahim bin Musa Ar Razi] telah mengabarkan kepada kami [Isa bin Yunus] dari [Tsaur] dari [Al Hushain Al Hubrani] dari [Abu Sa'id] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Barang siapa bercelak hendaklah dia melakukannya dengan ganjil, barangsiapa yang melakukannya maka dia telah berbuat baik, dan barangsiapa yang tidak melakukannya maka tidak ada dosa baginya. Barangsiapa yang beristinja dengan batu hendaklah dia melakukannya dengan ganjil, barangsiapa yang melakukannya maka dia telah berbuat baik dan barangsiapa yang tidak melakukannya maka tidak ada dosa baginya. Barangsiapa yang makan, maka apa yang menyangkut hendaklah dia membuangnya, dan yang dapat di lepas oleh lidah hendaknya dia menelannya, Barangsiapa yang melakukannya maka dia telah berbuat baik dan barangsiapa yang tidak melakukannya maka tidak ada dosa baginya. Barangsiapa mendatangi tempat buang air maka hendaklah dia mengambil satir (penutup), dan jika tidak menemukan kecuali dengan mengumpulkan setumpuk pasir, maka hendaklah dia membelakanginya, karena sesungguhnya seta bermain-main dengan tempat duduk anak Adam. Barangsiapa yang melakukannya maka dia telah berbuat baik dan barangsiapa yang tidak melakukannya maka tidak ada dosa baginya.\" Abu Dawud berkata; Diriwayatkan oleh [Abu 'Ashim] dari [Tsaur]. Hushain Al Himyari berkata; dan diriwayatkan oleh [Abdul Malik bin Ash Shabbah] dari [Tsaur], dia berkata; [Abu Sa'id Al Khair]. Abu Dawud berkata; Abu Sa'id Al Khair termasuk di antara sahabat Nabi shallallahu 'alaihi wasallam. "
  },
  {
    "number": 33,
    "arab": "عنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَالَ: لَوْ يُعْطَى النَّاسُ بِدعوَاهُمْ لادَّعَى رِجَالٌ أَمْوَال قَومٍ وَدِمَاءهُمْ، وَلَكِنِ البَينَةُ عَلَى المُدَّعِي، وَاليَمينُ عَلَى مَن أَنكَر",
    "id": "Telah menceritakan kepada kami [Yazid bin Khalid bin Abdullah bin Mauhib Al Hamdani] telah menceritakan kepada kami [Al Mufadhdhal, yakni Ibnu Fadhalah Al Mishri] dari ['Ayyasy bin Abbas Al Qitbani] bahwasanya [Syiyaim bin Baitan] telah mengabarkan kepadanya dari [Syaiban Al Qitbani] dia berkata; Sesungguhnya Maslamah bin Mukhallad pernah menugaskan [Ruwaifi' bin Tsabit] sebagai walikota di Asfal al Ardl (daerah dataran rendah di Mesir). Syaiban melanjutkan; Kami berjalan bersamanya dari Kum Syarik ke 'Alqama` -atau dari 'Alqama` ke Kaum Syarik- dengan tujuan 'Alqam. Ruwaifi' berkata; \"pada zaman Rasulullah shallallahu 'alaihi wasallam hidup, ada salah seorang diantara kami yang mempergunakan unta milik temannya sampai kurus dengan syarat separuh hasil perolehan ghanimah untuk pemilik unta dan separuhnya untuk kami. Dan jika salah seorang diantara kami mendapatkan mata panah dan bulunya sedang yang lain mendapatkan wadahnya. Ruwaifi' melanjutkan; Rasulullah pernah berpesan kepadaku; \"wahai Ruwaifi'! bisa jadi kamu akan memiliki umur yang panjang sepeninggalku, maka kabarkanlah kepada orang banyak, bahwa siapa yang mengikat jenggotnya atau mengikatkan kalung pada kudanya, atau beristinja dengan kotoran binatang atau tulang, maka sesungguhnya Muhammad shallallahu 'alaihi wasallam berlepas diri dari orang tersebut.\" Telah menceritakan kepada kami [Yazid bin Khalid] telah menceritakan kepada kami [Al Mufadhdhal] dari ['Ayyasy] bahwasanya [Syiyaim bin Baitan] telah mengabarkan kepadanya dengan hadits ini, juga dari [Abu Salim Al Jaisyani] dari [Abdullah bin 'Amr] dan menyebutkan hal itu, dan dia saat itu terikat di pintu Alyun. "
  },
  {
    "number": 34,
    "arab": "عَنْ أَبي سَعيدٍ الخُدريِّ رضي الله عنه قَالَ: سَمِعتُ رِسُولَ اللهِ ﷺ يَقولُ: (مَن رَأى مِنكُم مُنكَرَاً فَليُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَستَطعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَستَطعْ فَبِقَلبِه وَذَلِكَ أَضْعَفُ الإيمَانِ)",
    "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] telah menceritakan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Zakariyya bin Ishaq] telah menceritakan kepada kami [Abu Az Zubair] bahwa dia pernah mendengar [Jabir bin Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang kami untuk beristinja dengan kotoran binatang. "
  },
  {
    "number": 35,
    "arab": "عَنْ أَبي هُرَيرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (لاَ تَحَاسَدوا، وَلاَتَنَاجَشوا، وَلاَ تَبَاغَضوا، وَلاَ تَدَابَروا، وَلاَ يَبِع بَعضُكُم عَلَى بَيعِ بَعضٍ، وَكونوا عِبَادَ اللهِ إِخوَانَاً، المُسلِمُ أَخو المُسلم، لاَ يَظلِمهُ، وَلاَ يَخذُلُهُ، وَلا يكْذِبُهُ، وَلايَحْقِرُهُ، التَّقوَى هَاهُنَا - وَيُشيرُ إِلَى صَدرِهِ ثَلاَثَ مَراتٍ - بِحَسْبِ امرىء مِن الشَّرأَن يَحْقِرَ أَخَاهُ المُسلِمَ، كُلُّ المُسِلمِ عَلَى المُسلِمِ حَرَام دَمُهُ وَمَالُه وَعِرضُه)",
    "id": "Telah menceritakan kepada kami [Haiwah bin Syuraih Al Himshi] telah menceritakan kepada kami [Ibnu 'Ayyasy] dari [Yahya bin Abu 'Amru As Saibani] dari [Abdullah bin Ad Dailami] dari [Abdullah bin Mas'ud] dia berkata; Telah datang utusan dari bangsa jin kepada Rasulullah shallallahu 'alaihi wasallam, seraya berkata; \"Wahai Muhammad, laranglah umatmu untuk beristinja' dengan tulang, atau kotoran binatang atau arang, karena sesungguhnya Allah Ta'ala telah menjadikan rizki kami pada hal Hal tersebut!\" Maka Rasulullah shallallahu 'alaihi wasallam melarang umatnya untuk melakukan demikian. "
  },
  {
    "number": 36,
    "arab": "عَنْ أَبي هُرَيرَة رضي الله عنه عَنِ النبي ﷺ قَالَ: )مَنْ نَفَّسَ عَنْ مُؤمِن كُربَةً مِن كُرَبِ الدُّنيَا نَفَّسَ اللهُ عَنهُ كُربَةً مِنْ كرَبِ يَوم القيامَةِ، وَمَنْ يَسَّرَ على مُعسرٍ يَسَّرَ الله عَلَيهِ في الدُّنيَا والآخِرَة، وَمَنْ سَتَرَ مُسلِمَاً سَتَرَهُ الله في الدُّنيَا وَالآخِرَة، وَاللهُ في عَونِ العَبدِ مَا كَانَ العَبدُ في عَونِ أخيهِ، وَمَنْ سَلَكَ طَريقَاً يَلتَمِسُ فيهِ عِلمَاً سَهَّلَ اللهُ لهُ بِهِ طَريقَاً إِلَى الجَنَّةِ، وَمَا اجتَمَعَ قَومٌ في بَيتٍ مِنْ بيوتِ اللهِ يَتلونَ كِتابِ اللهِ وَيتَدارَسونهَ بَينَهُم إِلا نَزَلَت عَلَيهُم السَّكينَة وَغَشيَتهم الرَّحمَة وحَفَتهُمُ المَلائِكة وَذَكَرهُم اللهُ فيمَن عِندَهُ،وَمَنْ بَطَّأ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بهِ نَسَبُهُ",
    "id": "Telah menceritakan kepada kami [Sa'id bin Manshur] dan [Qutaibah bin Sa'id] mereka berdua berkata; Telah menceritakan kepada kami [Ya'qub bin Abdurrahman] dari [Abu Hazim] dari [Muslim bin Qurth] dari ['Urwah] dari [Aisyah] bahwasanya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang di antara kalian pergi untuk buang air besar, maka hendaklah dia membawa tiga batu untuk beristinja, sesungguhnya itu mencukupinya.\""
  },
  {
    "number": 37,
    "arab": "عَن ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا عَنِ النبي ﷺ فِيْمَا يَرْوِيْهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالى أَنَّهُ قَالَ: (إِنَّ الله كَتَبَ الحَسَنَاتِ وَالسَّيئَاتِ ثُمَّ بَيَّنَ ذَلِكَ؛ فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً،وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمائَةِ ضِعْفٍ إِلىَ أَضْعَاف كَثِيْرَةٍ. وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللهُ عِنْدَهُ حَسَنَةً كَامِلَةً،وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللهُ سَيِّئَةً وَاحِدَةً) ",
    "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad An Nufaili] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hisyam bin 'Urwah] dari ['Amru bin Khuzaimah] dari ['Umarah bin Khuzaimah] dari [Khuzaimah bin Tsabit] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah ditanya tentang beristinja dengan batu, maka beliau menjawab: \"Dengan tiga batu yang tidak ada kotoran binatang padanya.\" Abu Dawud berkata; Begitulah diriwayatkan oleh [Abu Usamah] dan [Ibnu Numair] dari [Hisyam], yakni Ibnu Urwah. "
  },
  {
    "number": 38,
    "arab": "عَنْ أَبِي هُرَيْرَةَ رضي الله عنه قَالَ: قَالَ رَسُولُ اللهِ ﷺ : (إِنَّ اللهَ تَعَالَى قَالَ: مَنْ عَادَى لِي وَلِيَّاً فَقَدْ آذَنْتُهُ بِالحَرْبِ. وَمَا تَقَرَّبَ إِلِيَّ عَبْدِيْ بِشَيءٍ أَحَبَّ إِلِيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ. ولايَزَالُ عَبْدِيْ يَتَقَرَّبُ إِلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبتُهُ كُنْتُ سَمْعَهُ الَّذِيْ يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِيْ يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِيْ بِهَا. وَلَئِنْ سَأَلَنِيْ لأُعطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِيْ لأُعِيْذَنَّهُ) ",
    "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] dan [Khalaf bin Hisyam Al Muqri`] mereka berdua berkata; Telah menceritakan kepada kami [Abdullah bin Yahya At Tau`am]. Dan menurut jalur lain; telah menceritakan kepada kami ['Amru bin 'Aun] dia berkata; telah mengabarkan kepada kami [Abu Ya'qub At Tau`am] dari [Abdullah bin Abu Mulaikah] dari [Ibunya] dari [Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam buang air kecil, lalu Umar berdiri di belakang beliau dengan membawa wadah air, maka beliau bersabda: \"Apa ini wahai Umar?\" Umar menjawab; \"Air untuk berwudhu.\" beliau bersabda: \"Aku tidak diperintahkan setiap kali selesai buang air kencing untuk berwudhu, dan kalau aku melakukannya, maka ia menjadi amalan sunnah.\""
  },
  {
    "number": 39,
    "arab": "عَنِ ابْنِ عَبَّاسٍ رَضِيَ اللهُ عَنْهُمَا أَنَّ رَسُولَ اللهِ ﷺ قَال: (إِنَّ اللهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ) ",
    "id": "Telah menceritakan kepada kami [Wahb bin Baqiyyah] dari [Khalid, yakni Al Wasithi] dari [Khalid, yakni Al Hadzdza`] dari ['Atha` bin Abu Maimunah] dari [Anas bin Malik] bahwasanya Rasulullah shallallahu 'alaihi wasallam memasuki sebuah kebun bersama seorang anak kecil yang membawa tempat air wudhu, ia adalah orang yang paling kecil di kalangan kami, lalu dia meletakkan tempat air wudhu tersebut di sisi pohon bidara, kemudian beliau membuang hajatnya, lalu keluar menemui kami sementara beliau telah beristinja dengan air. "
  },
  {
    "number": 40,
    "arab": "عَنِ ابْنِ عُمَرَ رَضِيَ اللهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللهِ ﷺ بِمنْكبيَّ فَقَالَ: (كُنْ فِي الدُّنْيَا كَأَنَّكَ غَرِيْبٌ أَوْ عَابِرُ سَبِيْلٍ) وَكَانَ ابْنُ عُمَرَ رَضِيَ اللهُ عَنْهُمَا يَقُوْلُ: إِذَا أَمْسَيْتَ فَلا تَنْتَظِرِ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلا تَنْتَظِرِ المَسَاءَ. وَخُذْ مِنْ صِحَّتِكَ لِمَرَضِكَ، وَمِنْ حَيَاتِكَ لمَوْتِكَ",
    "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah mengabarkan kepada kami [Mu'awiyah bin Hisyam] dari [Yunus bin Al Harits] dari [Ibrahim bin Abi Maimunah] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dia berkata; Ayat ini turun berkaitan dengan penduduk Quba, \"Di dalamnya ada orang-orang yang ingin membersihkan diri.\" Abu hurairah berkata; \"Mereka beristinja dengan air, maka ayat ini turun berkaitan dengan mereka.\""
  },
  {
    "number": 41,
    "arab":"عَنْ أَبِيْ مُحَمَّدٍ عَبْدِ اللهِ بِنِ عمْرِو بْنِ العَاصِ رَضِيَ اللهُ عَنْهُمَا قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: (لاَيُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَواهُ تَبَعَاً لِمَا جِئْتُ بِهِ)",
    "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah mengabarkan kepada kami [Mu'awiyah bin Hisyam] dari [Yunus bin Al Harits] dari [Ibrahim bin Abi Maimunah] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dia berkata; Ayat ini turun berkaitan dengan penduduk Quba, \"Di dalamnya ada orang-orang yang ingin membersihkan diri.\" Abu hurairah berkata; \"Mereka beristinja dengan air, maka ayat ini turun berkaitan dengan mereka.\""
  },
  {
    "number": 42,
    "arab":"عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه قَالَ: سَمِعْتُ رَسُولَ اللهِ يَقُولُ: قَالَ اللهُ تَعَالَى: (يَا ابْنَ آَدَمَ إِنَّكَ مَا دَعَوتَنِيْ وَرَجَوتَنِيْ غَفَرْتُ لَكَ عَلَى مَا كَانَ مِنْكَ وَلا أُبَالِيْ، يَا ابْنَ آَدَمَ لَو بَلَغَتْ ذُنُوبُكَ عَنَانَ السَّمَاءِ ثُمَّ استَغْفَرْتَنِيْ غَفَرْتُ لَكَ، يَا ابْنَ آَدَمَ إِنَّكَ لَو أَتَيْتَنِيْ بِقِرَابِ الأَرْضِ خَطَايَا ثُمَّ لقِيْتَنِيْ لاَ تُشْرِك بِيْ شَيْئَاً لأَتَيْتُكَ بِقِرَابِهَا مَغفِرَةً)",
    "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah mengabarkan kepada kami [Mu'awiyah bin Hisyam] dari [Yunus bin Al Harits] dari [Ibrahim bin Abi Maimunah] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dia berkata; Ayat ini turun berkaitan dengan penduduk Quba, \"Di dalamnya ada orang-orang yang ingin membersihkan diri.\" Abu hurairah berkata; \"Mereka beristinja dengan air, maka ayat ini turun berkaitan dengan mereka.\""
  }
]